#Создаем БД и таблицы 
CREATE DATABASE TZ;
USE TZ; 

CREATE TABLE Patients (
    id INT PRIMARY KEY AUTO_INCREMENT,
    First_name VARCHAR(50),
    Second_name VARCHAR(50),
    Last_name VARCHAR(50),
    gender INT, 
    Dt_birth DATE,
    Id_region INT,
    code_service INT,
    dt_reg DATE
);

CREATE TABLE Region (
    id INT PRIMARY KEY AUTO_INCREMENT,
    Name_ru VARCHAR(100),
    Name_kz VARCHAR(100)
);

CREATE TABLE Service (
    id INT PRIMARY KEY AUTO_INCREMENT,
    code INT UNIQUE, 
    Name_ru VARCHAR(100),
    Name_kz VARCHAR(100)
);

CREATE TABLE table1 (
    id INT PRIMARY KEY,
    IIN VARCHAR(12),
    birth_date DATE
);

CREATE TABLE table2 (
    id INT PRIMARY KEY,
    IIN VARCHAR(12),
    birth_date DATE
);

#Заполняем таблицы
INSERT INTO Region (Name_ru, Name_kz) VALUES
('Алматы', 'Алматы'),
('Астана', 'Астана'),
('Шымкент', 'Шымкент'),
('Актау', 'Актау'),
('Атырау', 'Атырау');

INSERT INTO Service (code, Name_ru, Name_kz) VALUES
(100, 'Анализ крови', 'Қан талдауы'),
(200, 'УЗИ', 'УДЗ'),
(300, 'Консультация терапевта', 'Терапевт кеңесі'),
(400, 'Консультация невропатолога', 'Невропатолог кеңесі'),
(500, 'Консультация эндокринолога', 'Эндокринолог кеңесі'),
(600, 'Консультация педиатра', 'Педиатр кеңесі'),
(700, 'Консультация гастроэнтеролога', 'Гастроэнтеролог кеңесі')
;

INSERT INTO Patients (First_name, Second_name, Last_name, gender, Dt_birth, Id_region, code_service, dt_reg) VALUES
('Иван', 'Петрович', 'Сидоров', 0, '1985-01-10', 1, 100, '2024-01-15'),
('Анна', 'Сергеевна', 'Иванова', 1, '1990-02-20', 2, 200, '2024-02-10'),
('Даулет', 'Канатович', 'Байдавлетов', 0, '1978-03-05', 1, 300, '2024-03-20'),
('Мария', 'Алексеевна', 'Новикова', 1, '1982-04-18', 3, 400, '2024-04-25'),
('Дмитрий', 'Юрьевич', 'Козлов', 0, '1995-05-12', 4, 400, '2024-05-01'),
('Елена', 'Павловна', 'Морозова', 1, '1988-06-30', 5, 500, '2024-06-10'),
('Бауыржан', 'Аскарович', 'Алматов', 0, '1992-07-15', 4, 600, '2024-03-15'),
('Оксана', 'Николаевна', 'Смирнова', 1, '1993-08-25', 5, 700, '2024-04-01'),
('Николай', 'Дмитриевич', 'Лебедев', 0, '1980-09-09', 1, 400, '2024-02-05'),
('Ирина', 'Михайловна', 'Орлова', 1, '1985-10-30', 3, 500, '2024-01-10'),
('Айгуль', 'Канатовна', 'Кантова', 1, '1969-11-30', 2, 600, '2023-01-10'),
('Айгерим', 'Санжаровна', 'Жарасова', 1, '2000-09-15', 5, 600, '2025-01-10'),
('Айман', 'Даулетовна', 'Сабырбаева', 1, '1992-07-30', 3, 200, '2024-12-10'),
('Айжан', 'Армановна', 'Сатпаева', 1, '1967-05-26', 4, 100, '2024-10-07');

INSERT INTO table1 (id, IIN, birth_date) VALUES
(1, '850110123456', '1985-01-10'),
(2, '900220234567', '1990-02-20'),
(3, '780305345678', '1978-03-05'),
(4, '820418456789', '1982-04-18'),
(5, '950512567890', '1995-05-12'),
(6, '880630678901', '1988-06-30'),
(7, '920715789012', '1992-07-15'),
(8, '930825890123', '1993-08-25'),
(9, '800909901234', '1980-09-09'),
(10, '851030012345', '1985-10-30'),
(11, '691130012345', '1969-11-30'),
(12, '000915012345', '2000-09-15'),
(13, '920730012345', '1992-07-30'),
(14, '670526012345', '1967-05-26'),
(15, '920730012345', '1992-07-30'),
(16, '950512567890', '1995-05-12'),
(17, '780305345678', '1978-03-05'),
(18, '920730012345', '1992-07-30');

INSERT INTO table2 (id, IIN, birth_date) VALUES
(1, '850110123456', '1985-01-10'),
(2, '900220234567', '1990-02-20'),
(3, '780305345678', '1978-03-05'),
(4, '820418456789', '1982-04-18'),
(5, '950512567890', '1995-05-12'),
(6, '880630678901', '1988-06-30'),
(7, '920715789012', '1992-07-15'),
(8, '930825890123', '1993-08-25'),
(9, '800909901234', '1980-09-09'),
(10, '000101000000', '2000-01-01'),
(11, '950512567890', '1995-05-12'),
(12, '950512567890', '1995-05-12'),
(13, '900220234567', '1990-02-20');  
