#					1. Подготовка:
#- Создайте таблицу accounts с двумя полями: id и balance.
CREATE TABLE accounts(
id INT,
balance DECIMAL(10,2)
);
#- Вставьте начальные данные в таблицу: например, учетную запись с id=1 и balance=1000.
INSERT INTO accounts(id, balance)
VALUES (1, 1000);

#					2. Запуск первого сеанса:
#- Настройте уровень изоляции на READ UNCOMMITTED.
SET AUTOCOMMIT = 0;
SET TRANSACTION ISOLATION LEVEL READ UNCOMMITTED;
#- Начните транзакцию.
START TRANSACTION;
#- Измените баланс учетной записи, но не подтверждайте изменения.
UPDATE accounts SET balance = 1500 WHERE id = 1;

#					3. Запуск второго сеанса:
#- Настройте уровень изоляции на READ UNCOMMITTED.
#- Выполните запрос к таблице accounts, чтобы увидеть измененные данные, которые еще не были подтверждены первым сеансом.

#					Данные были изменены даже если в первом сеансе не было команды COMMIT

#					4. Завершение первого сеанса:
#- В первом сеансе выполните ROLLBACK.
ROLLBACK;
#- Снова запустите запрос во втором сеансе, чтобы увидеть, как данные вернулись к исходному состоянию.

#					После команды ROLLBACK во втором сеансе вернулись исходные данные из таблицы.